Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElements Property
 Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoSpaceBoundingElements { get; }
Visual Basic
Public Shared ReadOnly Property NoSpaceBoundingElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoSpaceBoundingElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace